In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
employ_file= "DP_LIVE_Employdata.csv"
GDP_file="DP_LIVE_GDPdata.csv"

In [3]:
employ_df = pd.read_csv(employ_file)
employ_df.head()

  LOCATION INDICATOR SUBJECT   MEASURE FREQUENCY  TIME   Value Flag Codes
0      AUS       EMP     MEN  THND_PER         A  1965  3346.5        NaN
1      AUS       EMP     MEN  THND_PER         A  1966  3362.5        NaN
2      AUS       EMP     MEN  THND_PER         A  1967  3412.5        NaN
3      AUS       EMP     MEN  THND_PER         A  1968  3474.0        NaN
4      AUS       EMP     MEN  THND_PER         A  1969  3548.0        NaN

In [4]:
GDP_df=pd.read_csv(GDP_file)
GDP_df.head()

  LOCATION INDICATOR SUBJECT  MEASURE FREQUENCY  TIME       Value Flag Codes
0      AUS       GDP     TOT  MLN_USD         A  1960  25036.1668        NaN
1      AUS       GDP     TOT  MLN_USD         A  1961  25326.3822        NaN
2      AUS       GDP     TOT  MLN_USD         A  1962  27913.2057        NaN
3      AUS       GDP     TOT  MLN_USD         A  1963  30385.7232        NaN
4      AUS       GDP     TOT  MLN_USD         A  1964  32695.8783        NaN

In [5]:
GDP_new_df=GDP_df[["LOCATION","INDICATOR","SUBJECT","TIME","Value"]]
GDP_new_df.head()

  LOCATION INDICATOR SUBJECT  TIME       Value
0      AUS       GDP     TOT  1960  25036.1668
1      AUS       GDP     TOT  1961  25326.3822
2      AUS       GDP     TOT  1962  27913.2057
3      AUS       GDP     TOT  1963  30385.7232
4      AUS       GDP     TOT  1964  32695.8783

In [6]:
GDP_new_df=GDP_new_df.rename(columns={"Value":"GDP Value"})

In [7]:
employ_new_df=employ_df[["LOCATION","INDICATOR","SUBJECT","TIME","Value"]]
employ_new_df.head()

  LOCATION INDICATOR SUBJECT  TIME   Value
0      AUS       EMP     MEN  1965  3346.5
1      AUS       EMP     MEN  1966  3362.5
2      AUS       EMP     MEN  1967  3412.5
3      AUS       EMP     MEN  1968  3474.0
4      AUS       EMP     MEN  1969  3548.0

#### Cleaning

In [10]:
# Dropping the values where subject != Total (Men; Women)
GDP_new_df = GDP_new_df.loc[GDP_new_df['SUBJECT'] == "TOT"]
employ_new_df = employ_new_df.loc[employ_new_df['SUBJECT'] == "TOT"]

In [16]:
#Employement has 2016-Q2 & 2016-12 data - need to get grouped, averaged out and replaced on yearly basis

employ_new_df['time'] = pd.to_datetime(employ_new_df['TIME']).apply(lambda x : pd.Period(x, freq='M').end_time)
employ_new_df

,LOCATION,INDICATOR,SUBJECT,TIME,Value,time
54,AUS,EMP,TOT,1964,4495.50000,1964-01-31 23:59:59.999999999
55,AUS,EMP,TOT,1965,4628.25000,1965-01-31 23:59:59.999999999
56,AUS,EMP,TOT,1966,4785.15000,1966-01-31 23:59:59.999999999
57,AUS,EMP,TOT,1967,4928.00000,1967-01-31 23:59:59.999999999
58,AUS,EMP,TOT,1968,5046.22500,1968-01-31 23:59:59.999999999
59,AUS,EMP,TOT,1969,5187.60000,1969-01-31 23:59:59.999999999
60,AUS,EMP,TOT,1970,5387.47500,1970-01-31 23:59:59.999999999
61,AUS,EMP,TOT,1971,5516.65000,1971-01-31 23:59:59.999999999
62,AUS,EMP,TOT,1972,5601.35000,1972-01-31 23:59:59.999999999
63,AUS,EMP,TOT,1973,5765.05000,1973-01-31 23:59:59.999999999
64,AUS,EMP,TOT,1974,5891.15000,1974-01-31 23:59:59.999999999
65,AUS,EMP,TOT,1975,5866.37500,1975-01-31 23:59:59.999999999
66,AUS,EMP,TOT,1976,5945.97500,1976-01-31 23:59:59.999999999
67,AUS,EMP,TOT,1977,6000.05000,1977-01-31 23:59:59.999999999
68,AUS,EMP,TOT,1978,5987.12500,1978-01-31 23:59:59.999999999
69,AUS,EMP,TOT,1979,6110.62400,1979-01-31 23:59:59.999999999
70,AUS,EMP,TOT,1980,6284.27000,1980-01-31 23:59:59.999999999
71,AUS,EMP,TOT,1981,6416.45700,1981-01-31 23:59:59.999999999
72,AUS,EMP,TOT,1982,6414.89200,1982-01-31 23:59:59.999999999
73,AUS,EMP,TOT,1983,6300.37000,1983-01-31 23:59:59.999999999
74,AUS,EMP,TOT,1984,6493.85400,1984-01-31 23:59:59.999999999
75,AUS,EMP,TOT,1985,6697.42500,1985-01-31 23:59:59.999999999
76,AUS,EMP,TOT,1986,6974.48900,1986-01-31 23:59:59.999999999
77,AUS,EMP,TOT,1987,7128.73500,1987-01-31 23:59:59.999999999
78,AUS,EMP,TOT,1988,7398.24200,1988-01-31 23:59:59.999999999
79,AUS,EMP,TOT,1989,7719.77000,1989-01-31 23:59:59.999999999
80,AUS,EMP,TOT,1990,7858.81700,1990-01-31 23:59:59.999999999
81,AUS,EMP,TOT,1991,7670.53500,1991-01-31 23:59:59.999999999
82,AUS,EMP,TOT,1992,7634.41600,1992-01-31 23:59:59.999999999
83,AUS,EMP,TOT,1993,7653.39500,1993-01-31 23:59:59.999999999
...,...,...,...,...,...,...
50531,LTU,EMP,TOT,2011-Q4,60.85566,2011-10-31 23:59:59.999999999
50532,LTU,EMP,TOT,2012-Q1,61.14078,2012-01-31 23:59:59.999999999
50533,LTU,EMP,TOT,2012-Q2,62.02594,2012-04-30 23:59:59.999999999
50534,LTU,EMP,TOT,2012-Q3,62.59621,2012-07-31 23:59:59.999999999
50535,LTU,EMP,TOT,2012-Q4,62.33235,2012-10-31 23:59:59.999999999
50536,LTU,EMP,TOT,2013-Q1,62.94092,2013-01-31 23:59:59.999999999
50537,LTU,EMP,TOT,2013-Q2,63.75595,2013-04-30 23:59:59.999999999
50538,LTU,EMP,TOT,2013-Q3,63.91800,2013-07-31 23:59:59.999999999
50539,LTU,EMP,TOT,2013-Q4,64.35387,2013-10-31 23:59:59.999999999
50540,LTU,EMP,TOT,2014-Q1,64.82178,2014-01-31 23:59:59.999999999
50541,LTU,EMP,TOT,2014-Q2,65.28511,2014-04-30 23:59:59.999999999
50542,LTU,EMP,TOT,2014-Q3,66.50189,2014-07-31 23:59:59.999999999
50543,LTU,EMP,TOT,2014-Q4,66.12352,2014-10-31 23:59:59.999999999
50544,LTU,EMP,TOT,2015-Q1,66.38650,2015-01-31 23:59:59.999999999
50545,LTU,EMP,TOT,2015-Q2,67.02591,2015-04-30 23:59:59.999999999
50546,LTU,EMP,TOT,2015-Q3,67.47972,2015-07-31 23:59:59.999999999
50547,LTU,EMP,TOT,2015-Q4,68.02103,2015-10-31 23:59:59.999999999
50548,LTU,EMP,TOT,2016-Q1,68.68714,2016-01-31 23:59:59.999999999
50549,LTU,EMP,TOT,2016-Q2,69.51028,2016-04-30 23:59:59.999999999
50550,LTU,EMP,TOT,2016-Q3,69.58363,2016-07-31 23:59:59.999999999
50551,LTU,EMP,TOT,2016-Q4,69.74896,2016-10-31 23:59:59.999999999
50552,LTU,EMP,TOT,2017-Q1,69.61819,2017-01-31 23:59:59.999999999
50553,LTU,EMP,TOT,2017-Q2,70.48386,2017-04-30 23:59:59.999999999
50554,LTU,EMP,TOT,2017-Q3,70.46899,2017-07-31 23:59:59.999999999
50555,LTU,EMP,TOT,2017-Q4,71.06284,2017-10-31 23:59:59.999999999
50556,LTU,EMP,TOT,2018-Q1,71.26472,2018-01-31 23:59:59.999999999
50557,LTU,EMP,TOT,2018-Q2,71.97596,2018-04-30 23:59:59.999999999
50558,LTU,EMP,TOT,2018-Q3,73.49959,2018-07-31 23:59:59.999999999
50559,LTU,EMP,TOT,2018-Q4,72.93099,2018-10-31 23:59:59.999999999
50560,LTU,EMP,TOT,2019-Q1,73.07041,2019-01-31 23:59:59.999999999